#!/usr/bin/env bash
# این اسکریپت توسط GitHub Actions در یک کانتینر سادهٔ jammy اجرا می‌شود؛ آن 
# -نیازمندی‌های حداقلی سیستم و Poetry را نصب می‌کند؛
# - فایل تعریف پروژه را ویرایش می‌کند تا تنها به نسخه‌های قدیمی ارجاع دهد؛
# - یک محیط مجازی (venv) با استفاده از Poetry و این نسخه‌های قدیمی ایجاد می‌کند؛ و در نهایت
# - `trial` را فراخوانی می‌کند تا تست‌ها با وابستگی‌های قدیمی اجرا شوند.


#-------------------------------------------#
#این اسکریپت شِل (bash) برای اجرای تست‌های پروژه با قدیمی‌ترین نسخه‌های ممکن
# از وابستگی‌ها (dependencies) طراحی شده است و در محیط GitHub Actions روی یک کانتینر اوبونتو jammy (22.04) اجرا می‌شود. 
# هدف اصلی آن این است که اطمینان حاصل شود کد پروژه با نسخه‌های قدیمی وابستگی‌ها نیز به درستی کار می‌کند (یعنی سازگاری عقب‌رفتن — backward compatibility).
#------------------------------------------#

#این نوع تست‌ها به نام "lowest dependency tests" شناخته می‌شوند و در CI برای جلوگیری از مشکلات سازگاری در آینده استفاده می‌شوند. 


set -ex
#در صورت خطا، اسکریپت متوقف می‌شود


export VIRTUALENV_NO_DOWNLOAD=1

sed -i \
   -e "s/[~>]=/==/g" \
   -e '/^python = "^/!s/\^/==/g' \
   -e "/psycopg2/d" \
   -e 's/pyOpenSSL = "==16.0.0"/pyOpenSSL = "==17.0.0"/' \
   -e '/systemd/d' \
   pyproject.toml

echo "::group::Patched pyproject.toml"
cat pyproject.toml
echo "::endgroup::"
